{
  "moods": {
    "happy": {
      "name_ar": "سعيد",
      "name_en": "Happy",
      "color": "#FFC107",
      "verses": [
        {
          "id": 1,
          "title": "الحديد ١٢ / Al-Hadid: 12",
          "verse_text": "يَوْمَ تَرَى الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ يَسْعَى نُورُهُم بَيْنَ أَيْدِيهِمْ وَبِأَيْمَانِهِم بُشْرَاكُمُ الْيَوْمَ جَنَّاتٌ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا ذَلِكَ هُوَ الْفَوْزُ الْعَظِيمُ",
          "content": "الآية تقول: ﴿يَوْمَ تَرَى الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ يَسْعَى نُورُهُم بَيْنَ أَيْدِيهِمْ وَبِأَيْمَانِهِم بُشْرَاكُمُ الْيَوْمَ جَنَّاتٌ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا ذَلِكَ هُوَ الْفَوْزُ الْعَظِيمُ﴾ [الحديد: ١٢].\n\nشوف، هذه الآية مش مجرد وعد، هي مشهد من المستقبل، مشهد يوم القيامة لما يُبعث الناس، يوم الظلمة العظمى اللي كل إنسان يتمنى فيه أمان ونور يهديه. الله سبحانه يصف لك حال المؤمنين والمؤمنات: نور يخرج منهم، يسعى قدامهم وعن أيمانهم، يضيء لهم الطريق وسط ظلمة المحشر. هذا النور هو ثمرة أعمالهم، صلواتهم، صدقاتهم، صبرهم، لحظات بكائهم في الخفاء من خشية الله. كل ذلك يتحول في ذلك اليوم إلى نور مادي حقيقي، يسعى قدامهم ويكون سبب طمأنينتهم.\n\nابن كثير قال: \"يسعى نورهم بين أيديهم أي قدامهم في ظلمة المحشر على الصراط، وعن أيمانهم يعني أعمالهم الصالحة التي كانت سبب النور\". والطبري ذكر أن هذا النور هو الذي يهديهم إلى الجنة ويضيء وجوههم. والقرطبي قال: \"هذا النور على قدر أعمالهم، فمنهم من نوره كالجبل، ومنهم من نوره كالنخلة، ومنهم من نوره على موضع قدميه يضيء مرة ويطفأ أخرى\".\n\nتأمل يا عزيزي القارئ، كل إنسان عاش في الدنيا سعيد بلذة الإيمان، حتى لو واجه حزن أو فقر أو ظلم، هذا النور يترجم تلك السعادة الصافية التي عاشها قلبه. هنا الله يوجه لهم الخطاب: ﴿بُشْرَاكُمُ الْيَوْمَ﴾، أي كأن الملائكة تناديهم وتبشرهم: البشرى لكم اليوم جنات، هذا يوم فرحكم الأعظم.\n\nالسعادة هنا مش مثل سعادة الدنيا، مؤقتة وتروح، لا، هذه سعادة أبدية: ﴿خَالِدِينَ فِيهَا﴾، ما فيها موت، ما فيها مرض، ما فيها خوف من الفقد. لذلك ختم الآية بقوله: ﴿ذَلِكَ هُوَ الْفَوْزُ الْعَظِيمُ﴾، كأنه يقول: هذا هو النجاح الحقيقي، هذا هو الإنجاز اللي يستحق كل التعب.\n\nالشيخ السعدي رحمه الله علّق على الآية وقال: \"هذا أعظم بشارة يفرح بها المؤمنون، أعظم من كل نعيم الدنيا، لأنها تدل على رضا الله ودخول جنته والخلود فيها\".\n\nفإذا نظرنا الى هذه الآيه: الله سبحانه يقول لك يا عزيزي القارئ، يا من تبحث عن السعادة، إن السعادة الحقيقية ليست في مال، ولا جاه، ولا دنيا، بل في النور الذي تحمله أعمالك بين يديك يوم القيامة. سعادتك هي أن تبقى ثابتًا على الطريق، لأنك بهذا النور ستُبشَّر بجنات الخلود، حيث لا قلق ولا ألم، بل راحة أبدية وفرح لا ينقطع.\n\nThe verse says:\n\"On the Day you see the believing men and the believing women, their light proceeding before them and on their right, [it will be said], 'Good news for you this Day: Gardens beneath which rivers flow, wherein you will abide eternally.' That is the great attainment.\" [Al-Hadid: 12]\n\nLook, this verse is not just a promise; it is a vivid scene from the future, the Day of Resurrection when all people are raised. On that Day of overwhelming darkness, when every soul longs for safety and guidance, Allah describes the state of the believers: a radiant light shining forth from them, moving ahead of them and to their right, illuminating their way through the darkness of the gathering place. This light is the very fruit of their deeds—their prayers, their charity, their patience, their hidden tears shed out of reverence for Allah. All of that transforms, on that Day, into a tangible light that goes before them, bringing peace and reassurance.\n\nIbn Kathir said: \"Their light will run before them in the darkness of the gathering place on the Sirat, and to their right, meaning their righteous deeds that were the cause of this light.\" Al-Tabari mentioned that this light will guide them to Paradise and brighten their faces. Al-Qurtubi explained: \"This light will be in proportion to their deeds: some will have light as great as a mountain, some as tall as a palm tree, and some will only have light at their feet, shining at times and extinguished at others.\"\n\nReflect, dear reader: every soul who lived in this world tasting the sweetness of faith—even if they endured sadness, poverty, or oppression—will see that pure inner joy translated into this guiding light. And here comes the divine address: \"Good news for you today\"—as if the angels are calling out to them with glad tidings: today is your day of joy, your day of ultimate happiness, with eternal gardens awaiting you.\n\nThis happiness is not like the fleeting joys of the world that fade away; this is eternal bliss: \"abiding therein forever.\" No death, no illness, no fear of loss. That is why the verse concludes with: \"That is the great attainment.\" It is as though Allah is telling you: this is the true success, the ultimate achievement worth every struggle.\n\nShaykh al-Sa'di (may Allah have mercy on him) commented: \"This is the greatest glad tiding for the believers, greater than any pleasure of this world, for it signifies Allah's approval, entry into His Paradise, and everlasting life therein.\"\n\nSo, when you reflect on this verse, Allah is speaking directly to you, dear seeker of happiness: true joy is not in wealth, nor in status, nor in worldly gains. It is in the light carried by your deeds on the Day of Judgment. Your happiness lies in remaining steadfast upon the path, for with that light you will be greeted with the glad tidings of eternal gardens—no anxiety, no pain, but everlasting peace and joy that never ends."
        }
      ]
    },
    "angry": {
      "name_ar": "غاضب",
      "name_en": "Angry", 
      "color": "#F44336",
      "verses": []
    },
    "sad": {
      "name_ar": "حزين",
      "name_en": "Sad",
      "color": "#2196F3", 
      "verses": []
    },
    "alone": {
      "name_ar": "وحيد",
      "name_en": "Alone",
      "color": "#9E9E9E",
      "verses": []
    },
    "afraid": {
      "name_ar": "خائف", 
      "name_en": "Afraid",
      "color": "#212121",
      "verses": []
    },
    "penitent": {
      "name_ar": "نادم",
      "name_en": "Penitent",
      "color": "#795548",
      "verses": []
    },
    "astray": {
      "name_ar": "تائه",
      "name_en": "Astray", 
      "color": "#4CAF50",
      "verses": []
    },
    "message": {
      "name_ar": "رسالة",
      "name_en": "Message",
      "color": "#9C27B0",
      "verses": []
    },
    "contact": {
      "name_ar": "تواصل معنا",
      "name_en": "Contact Us",
      "color": "#FF5722",
      "type": "contact"
    }
  }
}

